# 2. Реализовать класс Road (дорога).
# определить атрибуты: length (длина), width (ширина);
# значения атрибутов должны передаваться при создании экземпляра класса;
# атрибуты сделать защищёнными;
# определить метод расчёта массы асфальта, необходимого для покрытия всей дороги;
# использовать формулу: длина * ширина * масса асфальта для покрытия одного кв. метра
# дороги асфальтом, толщиной в 1 см * число см толщины полотна;
# проверить работу метода.
# Например: 20 м*5000 м*25 кг*5 см = 12500 т.
#

class Road():

    _length = 20
    _width = 5000



    def mass(self, mass_asphalt, value_sm):
        print(f'{int((self._length * self._width * mass_asphalt * value_sm)/1000)} т')

a = Road()
a.mass(25, 5)